app/controllers/devise/registrations_controller.rb

  def new
  	#if user_signed_in?
		  resource = build_resource({})
		 	@statuses = Status.all
---
SELECT "statuses".* FROM "statuses" ORDER BY id ASC

  def create
    build_resource
    @status = Status.find_by_id(params[:post][:status_id])
		@params_direction = params[:direction_name].eql?("-Veuillez choisir une direction-")
		@params_workshop = params[:workshop_name].eql?("-Veuillez choisir un atelier-")
		@params_team = params[:team_name].eql?("-Veuillez choisir une équipe-")
		@firstname = capitalization(params[:user][:firstname])
		@lastname = capitalization(params[:user][:lastname])

		if (@status.eql?(nil) || (@status.status_name.eql?("Chef de direction") && @params_direction) || (@status.status_name.eql?("Chef d'atelier") && (@params_direction || @params_workshop)) || (@status.status_name.eql?("Chef d'équipe") && (@params_direction || @params_workshop || @params_team)))
			clean_up_passwords(resource)
		  @statuses = Status.all
		  flash[:alert] = "Veuillez correctement choisir le statut."
		  respond_with_navigational(resource) { render_with_scope :new }
		else
		  if resource.save
		    if resource.active_for_authentication?
		      set_flash_message :notice, :signed_up if is_navigational_format?
		      sign_in(resource_name, resource)
		      respond_with resource, :location => after_sign_up_path_for(resource)
		    else
		      set_flash_message :notice, :inactive_signed_up, :reason => inactive_reason(resource) if is_navigational_format?
		      if (@status.status_name.eql?("Chef de direction") || @status.status_name.eql?("Chef d'atelier") || @status.status_name.eql?("Chef d'équipe"))
		      	resource.update_attributes(:firstname => @firstname, :lastname => @lastname, :status_id => @status.id, :status_number => translate_status(@status.id, params[:direction_name], params[:workshop_name], params[:team_name]))
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = 2 ORDER BY id ASC LIMIT 1
SELECT "statuses".* FROM "statuses" ORDER BY id ASC
UPDATE "users" SET "status_id" = 5, "status_number" = 6, "updated_at" = '2012-03-06 22:46:17.755468' WHERE "users"."id" = 8

  def get_directions
  	@directions_options = "<option>-Veuillez choisir une direction-</option>"
  	Direction.all.each do |direction|
---
SELECT "directions".* FROM "directions" ORDER BY id ASC

  def get_workshops
  	@selected_direction = params.first.first
  	@workshops_options = "<option>-Veuillez choisir un atelier-</option>"
		@workshops = Direction.find_by_direction_name(@selected_direction).workshops
		@workshops.each do |workshop|
---
SELECT "directions".* FROM "directions" WHERE "directions"."direction_name" = 'Food' ORDER BY id ASC LIMIT 1
SELECT "workshops".* FROM "workshops" WHERE ("workshops".direction_id = 1) ORDER BY workshop_name ASC

  def get_teams
  	@selected_workshop = params.first.first
  	@teams_options = "<option>-Veuillez choisir une équipe-</option>"
  	@teams = Workshop.find_by_workshop_name(@selected_workshop).teams.where("daily IS NOT TRUE")
  	@teams.each do |team|
---
SELECT "workshops".* FROM "workshops" WHERE "workshops"."workshop_name" = 'SAP2' ORDER BY workshop_name ASC LIMIT 1
SELECT "teams".* FROM "teams" WHERE ("teams".workshop_id = 10)