app/views/devise/registrations/new.html.erb

<script type="text/javascript" language="JavaScript">
$(document).ready(function() {
		//write a better function for hideAll
  	$(function(){
  		hideAll();
		});
    $("#post_status_id").change(function() {
    	selected_status = this.options[this.selectedIndex].text;
    	switch(selected_status){
    		case "-Veuillez choisir un statut-":
    			hideAll("slow");
  				break;
				case "Administrateur":
					hideAll("slow");
  				break;
				case "Chef de direction":
  				$(this).populateDirection(selected_status);
  				showDirection("slow");
  				break;
  			case "Chef d'atelier":
  				$(this).populateDirection(selected_status);
  				showDirection("slow");
---
SELECT "directions".* FROM "directions" ORDER BY direction_name ASC